// Використовується модуль readline, який дозволяє зчитувати введення користувача з термналі. 
// Ключове слово require є вбудованим в Node.js та використовується для підключення зовнішніх модулів у Node.js додаток.
// Підключаємо модуль readline та присвоюємо його до змінної readline. 
// Аргумент 'readline' - це ім'я модуля, який ми хочемо підключити. Коли Node.js зустрічає цей рядок у нашому коді, він знаходить та підключає модуль readline зі стандартної бібліотеки Node.js. 
// Після підключення ми можемо використовувати всі методи та властивості цього модуля у нашому додатку.
const readline = require('readline');
// Функція createInterface() створює інтерфейс для зчитування введення та виводу результатів. 
const rl = readline.createInterface({
    input: process.stdin,
    output: process.stdout
});
// Використовується метод question(), який створює запитання для користувача та очікує на введення відповіді. 
rl.question('Чи подобається вам програмування на JavaScript? (y/n) ', (answer1) => {
    rl.question('Чи знаєте ви, що таке змінні та як їх використовувати? (y/n) ', (answer2) => {
        rl.question('Чи бажаєте ви дізнатися більше про JavaScript? (y/n) ', (answer3) => {
            // Після отримання відповідей програма виводить їх в консоль за допомогою функції console.log()
            console.log(`Ваші відповіді:\n1. ${answer1}\n2. ${answer2}\n3. ${answer3}`);
            //   Для закриття інтерфейсу використовується метод close().
            rl.close();
        });
    });
});